/* 58. Написать программу, которая в двумерном массиве заменяет строки на столбцы 
или сообщить, что это невозможно (в случае, если матрица не квадратная).*/

using static Library;

Console.WriteLine("58. Написать программу, которая в двумерном массиве заменяет строки на столбцы или сообщить, что это невозможно (в случае, если матрица не квадратная).");
